trade_exp/src/DataProcessors/ЗагрузкаДополнительныхСведений_Альтерра/ЗагрузкаДополнительныхСведений_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДополнительныхСведений_Альтерра</name>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТипа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСведений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/DataProcessors/ЗагрузкаДополнительныхСведений_Альтерра/Forms/Форма/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.КэшированныеЗначения) Тогда
		КэшированныеЗначения = Параметры.КэшированныеЗначения;
	КонецЕсли;
		
	ЗаполнитьНастройки();
	Макет = Обработки.ЗагрузкаДополнительныхСведений_Альтерра.ПолучитьМакет("Макет");	
	
	Область=Макет.ПолучитьОбласть("Таблица");
	ТабличныйДокумент.Присоединить(Область);
	ТабличныйДокумент.ФиксацияСверху = 1;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Начало (Строка)";
	СтрокаНастройки.КодТипа = 1; //Строка;
	СтрокаНастройки.Значение="R2";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Конец (Строка)";
	СтрокаНастройки.КодТипа = 1; //Строка;
	СтрокаНастройки.Значение="R100";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Код (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C1";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Номенклатура (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C2";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Подразделение/Склад (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C3";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Значение (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C4";
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИРассчитать(Команда)
	УдалитьЗаполнениеЦветомВерхнейТаблицы("");
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	Объект.Товары.Очистить();
	ЕстьОбшибкиРаспознования = СопоставитьДанныеТДСНоменклатуройНаСервере();
	Если ЕстьОбшибкиРаспознования Тогда
		Сообщить("Есть ошибки распознования, ознакомьтесь с информационными сообщениями.");
	КонецЕсли;
	Если Объект.Товары.Количество() > 0 Тогда
		Элементы.ФормаПеренестиИЗакрыть.Видимость = Истина;
		Элементы.ФормаПеренестиИЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаполнениеЦветомВерхнейТаблицы(Команда)
	ТабличныйДокумент.Область(ПолучитьИмяОбластиИзНастроек()).ЦветФона = Новый Цвет();
КонецПроцедуры

&НаСервере
Функция СопоставитьДанныеТДСНоменклатуройНаСервере()
Если НЕ ЗначениеЗаполнено(ВидыСведений_Альтерра) Тогда
		Сообщить("Не указан Вид сведений");
		Возврат Ложь;
	КонецЕсли;

	ЦветИспользованныхДанных = Новый Цвет(100,255,0);
	ЦветНеассоциированныхДанных = Новый Цвет(255,200,200);
	ЕстьОшибкиРаспознавания = Ложь;
	Для Каждого СтрокаНастройки Из Объект.Настройки Цикл
		Если СтрокаНастройки.Настройка = "Код (Колонка)" Тогда
			КолонкаКод = СтрокаНастройки.Значение;
		КонецЕсли;
		Если СтрокаНастройки.Настройка = "Номенклатура (Колонка)" Тогда
			КолонкаНоменклатура = СтрокаНастройки.Значение; 
		КонецЕсли;
		Если СтрокаНастройки.Настройка = "Подразделение/Склад (Колонка)" Тогда
			КолонкаПодразделениеСклад = СтрокаНастройки.Значение;
		КонецЕсли;
		Если СтрокаНастройки.Настройка = "Значение (Колонка)" Тогда
			КолонкаЗначение = СтрокаНастройки.Значение;
		КонецЕсли;
	КонецЦикла;
	НомерПервойСтроки = 2;
	НомерПоследнейСтроки = 1000;
	НомерСтроки = НомерПервойСтроки - 1;
	Пока НомерСтроки + 1 <= НомерПоследнейСтроки Цикл
		НомерСтроки = НомерСтроки + 1;
		ИмяСтроки = "R" + Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		Код = ВернутьЗначениеЯчейкиПоУсловияю(ТабличныйДокумент, ИмяСтроки, КолонкаКод);
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Код);
		ВидСведений = ВидыСведений_Альтерра;
		Если ВидыСведений_Альтерра.ПоСкладу Тогда 
			ПодразделениеСклад = ВернутьСсылкуИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, КолонкаПодразделениеСклад, "ПодразделениеСклад","Склады");
		ИначеЕсли НЕ ВидыСведений_Альтерра.ПоСкладу Тогда
			ПодразделениеСклад = ВернутьСсылкуИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, КолонкаПодразделениеСклад, "ПодразделениеСклад","СтруктураПредприятия" );
		Иначе
			ПодразделениеСклад = Неопределено;
		КонецЕсли;	
		Значение = ВернутьСсылкуИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, КолонкаЗначение, "Значение","ЗначенияДополнительныхСведений_Альтерра",ВидыСведений_Альтерра);
		//Проверки
		РаскраситьЯчейки = Ложь;
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			ТабличныйДокумент.Область(ИмяСтроки+КолонкаНоменклатура).Текст = Номенклатура;
			Если НЕ ЗначениеЗаполнено(Значение) Тогда
				Сообщить("В строке " + Строка(НомерСтроки) + " не найдено значение доп сведений по указанному виду.");
			ИначеЕсли НЕ ЗначениеЗаполнено(ПодразделениеСклад) Тогда
				Сообщить("Некорректно заполнены данные Подразделение/склад в строке " + Строка(НомерСтроки));
			Иначе
				РаскраситьЯчейки = Истина;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ПодразделениеСклад) И НЕ ЗначениеЗаполнено(Значение)  Тогда
				Прервать;
			Иначе
	            Сообщить("В строке " + Строка(НомерСтроки) + " не найдена номенклатура по указанному коду. Проверьте код номенклатуры.");
			КонецЕсли;
		КонецЕсли; 
		
		Если РаскраситьЯчейки Тогда //сопоставление удалось...
			Строка = Объект.Товары.Добавить();
			Строка.Номенклатура = Номенклатура;
			Строка.ПодразделениеСклад = ПодразделениеСклад;
			Строка.ВидСведений = ВидСведений;
			Строка.Значение = Значение;
			РаскраситьЯчейкуПоУсловию(ТабличныйДокумент, ЦветИспользованныхДанных, ИмяСтроки);
		Иначе
			РаскраситьЯчейкуПоУсловию(ТабличныйДокумент, ЦветНеассоциированныхДанных, ИмяСтроки);
			ЕстьОшибкиРаспознавания = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьОшибкиРаспознавания;	
КонецФункции

&НаСервере
Функция ВернутьЗначениеЯчейкиПоУсловияю(ТД, ИмяСтроки, ИмяКолонки)
	Если ЗначениеЗаполнено(ИмяКолонки) Тогда
		Возврат СокрЛП(ТД.Область(ИмяСтроки + ИмяКолонки).Текст);
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Функция ВернутьСсылкуИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, Колонка, ИмяКолонки, ИмяСправочника, Владелец=Неопределено)
	Строка = ВернутьЗначениеЯчейкиПоУсловияю(ТабличныйДокумент, ИмяСтроки, Колонка);
	Если Строка <> "" Тогда
		Если ТипЗнч(Владелец) <> Тип("Неопределено") Тогда
			Ссылка = Справочники[ИмяСправочника].НайтиПоНаименованию(Строка, Истина,,Владелец);
		Иначе
			Ссылка = Справочники[ИмяСправочника].НайтиПоНаименованию(Строка, Истина);
		КонецЕсли;	
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Возврат Ссылка;
		Иначе
			Возврат Справочники[ИмяСправочника].ПустаяСсылка();
		КонецЕсли;
	Иначе
		Возврат Справочники[ИмяСправочника].ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервере
Процедура РаскраситьЯчейкуПоУсловию(ТД, Цвет, ИмяСтроки)
	ТД.Область(ИмяСтроки + "C1:" + ИмяСтроки + "C4").ЦветФона = Цвет;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяОбластиИзНастроек()
	МинСтр = -1;
	МаксСтр = -1; 
	МинКол = -1; 
	МаксКол = -1;
	Для Каждого СтрокаНастроек Из Объект.Настройки Цикл
		Если Не ЗначениеЗаполнено(СтрокаНастроек.Значение) Тогда Продолжить; КонецЕсли;
		Если СтрокаНастроек.КодТипа = 1 Тогда //Строка
			Стр = Число(Сред(СтрокаНастроек.Значение, 2));
			МинСтр = ?(МинСтр = -1, Стр, Мин(МинСтр, Стр));
			МаксСтр = ?(МаксСтр = -1, Стр, Макс(МаксСтр, Стр));
		ИначеЕсли СтрокаНастроек.КодТипа = 2 Тогда //Колонка
			Кол = Число(Сред(СтрокаНастроек.Значение, 2));
			МинКол = ?(МинКол = -1, Кол, Мин(МинКол, Кол));
			МаксКол = ?(МаксКол = -1, Кол, Макс(МаксКол, Кол));
		КонецЕсли;			
	КонецЦикла;
	Если МинСтр = -1 Или МаксСтр = -1 Или МинКол = -1 Или МаксКол = -1 Тогда
		Возврат "C1:C20";
	Иначе
		Возврат "R" + МинСтр + "C" + МинКол + ":" + "R" + МаксСтр + "C" + МаксКол;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПеренестиИЗакрыть(Команда)
	ЗаполнитьРегистрДополнительныеСведения();
	Объект.Товары.Очистить();
	ТабличныйДокумент.Область("R2C1:R1000C4").Текст = "";
	ТабличныйДокумент.Область("R2C1:R1000C4").ЦветФона = Новый Цвет();;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрДополнительныеСведения()
	Для Каждого Строка Из Объект.Товары Цикл 
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("Номенклатура", Строка.Номенклатура);
		СтруктураЗаписи.Вставить("ПодразделениеСклад", Строка.ПодразделениеСклад);
		СтруктураЗаписи.Вставить("ВидСведения", ВидыСведений_Альтерра);
		СтруктураЗаписи.Вставить("Значение", Строка.Значение);
		ОбменДаннымиСлужебный.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "ДополнительныеСведения_Альтерра");
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитВидСведения(ВидСведения)
	Возврат ВидСведения.ПоСкладу; 
КонецФункции

&НаКлиенте
Процедура ВидыСведений_АльтерраПриИзменении(Элемент)
	Если РеквизитВидСведения(ВидыСведений_Альтерра) Тогда
		ТабличныйДокумент.Область("R1C3").Текст = "Склад";
	ИначеЕсли НЕ РеквизитВидСведения(ВидыСведений_Альтерра) и ЗначениеЗаполнено(ВидыСведений_Альтерра) Тогда
		ТабличныйДокумент.Область("R1C3").Текст = "Подразделение";
	Иначе
		ТабличныйДокумент.Область("R1C3").Текст = "Подразделение/Склад";
	КонецЕсли;
КонецПроцедуры
